{"resources": [{"resource": {"lista": ["Technical CERT staff.", "7 hours", "Handbook", "Toolset", "Virtual Image", "Windows Tools", "Windows Cuckoo", "The main objective is to create safe and useful artifact analysis environment, based on current best practices."], "title": "Building artefact handling and analysis environment", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "5 hours", "Handbook", "Toolset", "Virtual Image", "Present the trainees various methods of malicious artifacts acquisition with emphasis on artifacts collected through spam e-mails monitoring. Teach how to correctly set up spam collecting environment and simple artifacts repository. Exercise also provides knowledge how to modify and patch created system to better suit lab environment needs."], "title": "Processing and storing artefacts", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "8 hours", "Handbook", "Toolset", "Virtual Image", "Present the trainees malicious artifact analysis fundamentals and various types of analyses. Present how to safely execute suspicious code in the controlled environment along with most important security precautions."], "title": "Artefact analysis fundamentals", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "8 hours", "Handbook", "Toolset", "Virtual Image 1", "Virtual Image 2", "AQ Tools", "Teach students how to obtain memory images from different sources and to analyse them. Both Windows and Linux systems will be covered."], "title": "Advanced artefact handling", "source": "enisa"}}, {"resource": {"lista": ["Incident handler and investigator ", "3 days", "Handbook", "Toolset", "Virtual Image I", "Virtual Image II", " ", "This three-day training module will follow the tracks of an incident handler and investigator, teaching best practices and covering both sides of the breach. It is technical in nature and has the aim to provide a guided training for both incident handlers and investigators while providing lifelike conditions. Training material mainly uses open source and free tools."], "title": "Forensic analysis: Local Incident Response ", "source": "enisa"}}, {"resource": {"lista": ["Incident handler and investigator ", " ", "Handbook", "Toolset", "Virtual Image", "The main goal of this training is to teach trainees network forensic techniques and extend trainees operating system forensic capabilities beyond Microsoft Windows systems to include Linux. Trainees will follow traces in the workstation and discover that analysed network captures together with logs, lead to another machine on the network."], "title": "Forensic analysis: Network Incident Response ", "source": "enisa"}}, {"resource": {"lista": ["Incident handler and investigator ", " ", "Handbook", "Toolset", "Virtual Image I", "Virtual Image II", "Virtual Image III", "Memory dump", "This training requires the students to perform a forensic analysis of three (web) servers, identified during the first two exercises as taking part in a malicious campaign."], "title": "Forensic analysis: Webserver Analysis", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "8 hours", "Handbook", "Toolset", "Virtual Image", "Learn how to leverage information gathered during analysis into actionable signatures. Both network and system oriented signatures will be discussed."], "title": "Developing countermeasures", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "8 hours", "Handbook", "Toolset", "Virtual Image", "Learn how to collect, store and correlate different types of information about samples and how to make use of this information with the assumption that having a structured and organised database is a good way to reaching synergy in the area of artifact analysis and incident investigation."], "title": "Common framework for artefact analysis activities", "source": "enisa"}}, {"resource": {"lista": ["CSIRT staff and incident handlers involved in the technical analysis of incidents.", "4 hours", "Handbook", "Toolset", "This training presents the introduction to the advanced artefact analysis. It is the first part of a three-day course introducing assembly language and tools commonly used for the advanced artefact analysis."], "title": "Introduction to advanced artefact analysis", "source": "enisa"}}, {"resource": {"lista": ["CSIRT staff and incident handlers involved in the technical analysis of incidents.", "9 hours", "Handbook", "Toolset", "This training presents methods and techniques of dynamic artefact analysis with the use of OllyDbg debugger package."], "title": "Dynamic analysis of artefacts", "source": "enisa"}}, {"resource": {"lista": ["CSIRT staff and incident handlers involved in the technical analysis of incidents.", "10 hours", "Handbook", "Toolset", "The goal of this training is to introduce the participants to all aspects of static artefact analysis."], "title": "Static analysis of artefacts", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "5 hours", "Handbook", "Toolset", "Virtual Image", "Present the trainees various methods of malicious artifacts acquisition with emphasis on artifacts collected through spam e-mails monitoring. Teach how to correctly set up spam collecting environment and simple artifacts repository. Exercise also provides knowledge how to modify and patch created system to better suit lab environment needs."], "title": "Processing and storing artefacts", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "7 hours", "Handbook", "Virtual Image", "Supporting Material", "Learn how to create and deploy indicators of compromise using Collaborative Research into Threats (CRITs) platform. Additionally, demonstrate how to leverage CRITs to visualize relationships among different elements of a campaign, how to extract indicators from incident data, develop mitigation actions, and track those actions."], "title": "Using indicators to enhance defence capabilities", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "4 hours", "Handbook", "Toolset", "Virtual Image", "VM How To", "Present the trainees with the principles of evidence gathering. Establish a common knowledge of the requirements regarding evidence admissibility in a court of law. This task also gives an overview of popular malware characteristics, methods of identification and tools that may be used at the scene."], "title": "Identification and handling of electronic evidence", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "6 hours", "Handbook", "Toolset", "Virtual Image", "VM How To", "Present the trainees with the principles of digital forensics and evidence gathering.             "], "title": "Digital forensics", "source": "enisa"}}, {"resource": {"lista": ["Technical and management CERT staff.", "4 hours", "Handbook", "Toolset", "Virtual Image", "Setting up and working with AbuseHelper.                                                                        "], "title": "Proactive incident detection", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "4 hours", "Handbook", "Toolset", "Virtual Image", "VM How To", "Make the students familiar with special requirements and tools to do incident handling and forensics with mobile/smartphone computing platforms."], "title": "Mobile threats incident handling", "source": "enisa"}}, {"resource": {"lista": ["CSIRT staff and incident handlers involved in the technical analysis of incident.", "24 hours", "Handbook", "Toolset", "Virtual Image", "The goal of this training is to introduce the threats found in mobile environment, and to familiarise the participants with various tools and techniques used in Mobile Forensics and Incident Handling."], "title": "Mobile threats Incident handling (Part II)", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers and technical staff.", "2 hours", "Handbook", "Toolset", "Virtual Image", "The purpose of this task is to develop students’ abilities to create custom scripts and filters dealing with large amounts of data such as IP addresses. After completing the exercise students should be able to extract useful information from bulk data, even in non-standard formats."], "title": "Automation in incident handling", "source": "enisa"}}, {"resource": {"lista": ["Technical CERT staff.", "6 hours", "Handbook", "Toolset", "Virtual Image", "During the network forensics training the participants will familiarise themselves with the common methodologies and approaches on how the network forensic process could be conducted in practice. Students will work with packet capture files, follow DDoS traces in NetFlow data, and get familiar with countermeasures in order to better protect the digital services."], "title": "Network forensics", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers and technical staff.", "3 hours", "Handbook", "Toolset", "Virtual Image", "Familiarise students with two kinds of honeypots: server-side honeypots and client-side honeypots."], "title": "Honeypots", "source": "enisa"}}, {"resource": {"lista": ["Managers and incident handlers.", "3 hours", "Handbook", "Toolset", "Virtual Image", "To provide a practical overview of the vulnerability handling process and how vulnerabilities reported to a CERT team should be handled. Also, to provide some hands-on experience with difficult situations that may arise through the role of coordinator."], "title": "Vulnerability handling", "source": "enisa"}}, {"resource": {"lista": ["CERT technical staff.", "6 hours", "Handbook", "Toolset", "Virtual Image 1", "Virtual Image 2", "Technical aspects of using visualisation to present, correlate and filter various feeds. The scenario will also cover the organisational aspects. In this scenario the students will be part of the CERT for a fictitious organisation which is analysing cybercrime activities."], "title": "Presenting, correlating and filtering various feeds", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers, incident management staff, technical CERT staff.", "5 hours", "Handbook", "Toolset", "Virtual Image", "VM How To", "Make CERT members aware of requirements during incident handling in CII/SCADA environments."], "title": "Incident handling during an attack on Critical Information Infrastructure", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers and technical CERT staff.", "3 hours", "Handbook", "Toolset", "This task provides students with information about methods commonly used by attackers during the Advanced Persistent Threat (APT) attacks as well as methods of discovering and protecting internal resources against these attacks. Examples used in the exercise are based on real incidents and observations. The objective is also to involve participants in creative approaches to building CERT capability to deal effectively with and resolve the problem of APT attacks within an organisation."], "title": "Advanced Persistent Threat incident handling", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers and technical CERT staff.", "3 hours", "Handbook", "Toolset", "In this task, participants will investigate the vulnerabilities of social networks, using an Advanced Persistent Threat scenario as a test case to illustrate some examples of social network compromises. They will also examine the capabilities of social networks to respond to these kinds of threats."], "title": "Social networks used as an attack vector for targeted attacks", "source": "enisa"}}, {"resource": {"lista": ["Technical and management CERT staff.", "4 hours", "Handbook", "Toolset", "The objective of the exercise is to provide a practical overview of what constitutes a good and a bad advisory publication for a CERT constituency."], "title": "Writing Security Advisories", "source": "enisa"}}, {"resource": {"lista": ["Managers of CERT staff, incident handlers who have to estimate losses.", "2 hours", "Handbook", "Toolset", "Spreadsheet (XLS)", "Spreadsheet (ODS)", "Make the CERT team familiar with one solution for estimating the costs of different information security incidents."], "title": "Cost of ICT incident", "source": "enisa"}}, {"resource": {"lista": ["Future CERT members.", "3 hours", "Handbook", "Toolset", "Simulate a real-life incident, involving many parties with conflicts of interests, different mindsets and legal frameworks, etc. With the introduction of such aspects as vulnerability handling, responsible disclosure and company security management, it helps the students to understand why incident handling is, in many cases, a complex task and what kinds of technical and social skills are required for this job."], "title": "Incident handling in live role playing", "source": "enisa"}}, {"resource": {"lista": ["Incident responders of all experience levels.", "4 hours", "Handbook", "Toolset", "Investigate methods to address cloud-based security vulnerabilities through a scenario where data is not always fixed to one physical server or location."], "title": "Incident handling in the cloud", "source": "enisa"}}, {"resource": {"lista": ["CERT incident handlers.", "5 hours", "Handbook", "Toolset", "Teach incident handlers the key information and actions required for the successful resolution of large-scale incidents."], "title": "Large scale incident handling", "source": "enisa"}}, {"resource": {"lista": ["The exercise is aimed at incident handlers at any level of experience. It requires a good understanding of Internet topology and services.", "2 hours", "Handbook", "Toolset", "Presentation", "This exercise provides students with experience of real-life incident reports, their ambiguity and complexity. After completing the exercise, they should understand:"], "title": "Incident Handling Management", "source": "enisa"}}, {"resource": {"lista": ["The training is aimed at CSIRT managers who are responsible for recruiting staff.", "1 day", "Handbook", "Toolset", "Presentation", "Resources", "This training sets out to provide an indication of what an organisation might consider during the recruitment of staff for CSIRT teams. "], "title": "Recruitment of CSIRT staff", "source": "enisa"}}, {"resource": {"lista": ["Technical and management CSIRT staff. ", "3-4 hours", "Handbook", "Toolset", "Presentation", "To learn what kind of software and hardware solutions could be used to provide a particular CSIRT service for a constituency. "], "title": "Developing CSIRT infrastructure", "source": "enisa"}}, {"resource": {"lista": ["Managers and incident handlers.", "3 hours", "Handbook", "Toolset", "To enhance students’ skills in establishing contacts with other CERTs, administrators of ISPs, and other parties responsible for the mitigation of security incidents in their networks around the globe."], "title": "Establishing external contacts", "source": "enisa"}}, {"resource": {"lista": ["Technical and management CERT staff.", "5 hours", "Handbook", "Toolset", " ", "Explain a CERT’s role in advising in a cyber-crime case and the basis for its effective cooperation with an LEA."], "title": "Cooperation with Law Enforcement Agencies - Advising in Cyber Crime Cases", "source": "enisa"}}, {"resource": {"lista": ["CERT incident responders of all experience levels.", "4 hours", "Handbook", "Toolset", "In this exercise, participants will discuss all fundamental concepts of the communication channels between CERTs and their constituents, other CERTs, law enforcement, management, public relations (PR), legal counsel, and all other stakeholders. Special attention is given to communications while under attack, and to the testing of communication channels as a means of safeguarding and improving them."], "title": "Assessing and Testing Communication Channels with CERTs and all their stakeholders", "source": "enisa"}}, {"resource": {"lista": ["CERT Staff.", "7 hours", "Handbook", "Toolset", "Virtual Image", "VM How To", "This task consists of 3 components: finding relevant information related to cybercrime in social media channels (based on Twitter examples), finding relevant information on IRC channels and analysing legal aspects of Internet monitoring activities related to cybercrime identification. The main objective is to teach trainees how to set up the basic system for continuous monitoring and alerting of various sources of information in terms of effective detection and warning for their constituencies based on the content."], "title": "Identifying and handling cyber-crime traces", "source": "enisa"}}, {"resource": {"lista": ["National CERTs, bank CERTs, CERTs for big companies or organisations.", "4 hours", "Handbook", "Toolset", "This task treats phishing on three levels: technical, organisational and legal. The purpose is to understand phishing campaigns better and understand how to resolve them in complex international contexts."], "title": "Incident handling and cooperation during phishing campaign", "source": "enisa"}}, {"resource": {"lista": ["Incident responders of all experience levels.", "6 hours", "Handbook", "Toolset", "This task covers three different cybercrime related cases. All of them involve investigatory and legal aspects, but each of them requires participants to analyse them from different perspectives. All cases involve very common incidents for CERTs and organisations that could lead to law enforcement actions and court cases. Cooperation among the various parties involved is therefore essential and is the goal of this exercise – rather than exploring the techniques involved."], "title": "Cooperation in the Area of Cybercrime", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers and CERT managers.", "3 hours", "Handbook", "Toolset", "data_ddos.pcap", "Information about rules, procedures and best practice in handling incident related to obligation for internet service providers described in the Article 13a of the European Telecom Package."], "title": "CERT participation in incident handling related to the Article 13a obligations", "source": "enisa"}}, {"resource": {"lista": ["Incident handlers and CERT managers.", "2 hours", "Handbook", "Toolset", "Information about rules, procedures and best practices in incident handling related to personal data breaches. It is based on data breach notification requirements for the electronic communication sector introduced by the review of the ePrivacy Directive. The process of notification is parallel to normal incident handling process and it is part of it."], "title": "CERT participation in incident handling related to the Article 4 obligations", "source": "enisa"}}]}